In [14]:
##############
#K. David Roell CFPB 7/12/16
#expands data selection for quality edits to include context for developing statistical approaches
#will attemtp to segment mortgage market participants by loan activity by:
#volume/count of lending, income of applicants, securitization, property type and other factors
##############

import json
import os
import pandas as pd
import psycopg2
import matplotlib
import matplotlib.pyplot as plt
import matplotlib.patches as mpatches
import numpy as np
get_ipython().magic(u'matplotlib inline')
matplotlib.style.use('ggplot')

with open('quality_sql.json') as f: #FIXME change to quality_sql.json and refactor the rest of code
    edit_sql = json.load(f)
    
#parameter format for local use #consider changing hmdamaster to roellk if db changes cause a fail
params = {
'dbname':'hmdamaster',
'user':'roellk',
'password':'',
'host':'localhost',
}

try:
    conn = psycopg2.connect(**params)
    cur = conn.cursor()
    print("i'm connected")

except psycopg2.Error as e: #if database connection results in an error print the following
    print("I am unable to connect to the database: ", e)

i'm connected

In [15]:
#get distributions of values for fields
def field_dist_geo(field1=None, field2=None, table=None, geo_level=None, prop_type=None, loan_purp=None, loan_type=None, occupancy=None, lien=None):
    """generates a sql statement used to pull values and associated counts for the listed variable subject to listed filters"""
    #FIXME use a list instead of prop_type, loan_purp, loan_type
    if geo_level == 'msa':
        geo_sql = 'msa,'
    elif geo_level == 'state':
        geo_sql = 'state,'
    elif geo_level == 'county':
        geo_sql = 'CONCAT(state,county),'
    elif geo_level == 'tract':
        geo_sql = 'CONCAT(state,county,tract),'
    else:
        geo_sql = ''
    
    dist_sql = """SELECT DISTINCT year, {geo_sql} {field1}, {field2}
    FROM {table} """.format(table=table, field1=field1, field2=field2, geo_sql=geo_sql) 
    #FIXME make flexible to acommodate lack of geography
    #FIXME convert named params to None and raise value error 
    #removing the bulk of quesitonable data in exploration by removing HUD
    where_sql = """WHERE agency != '7' AND property_type IN ('{prop_type}') AND loan_purpose IN ('{loan_purp}') 
    AND  occupancy='{occupancy}' AND lien = '{lien}' AND income NOT ILIKE '%NA%' AND amount NOT ILIKE 
    '%NA%' """.format(prop_type=prop_type, loan_purp=loan_purp,  lien=lien, occupancy=occupancy)

    group_sql = """GROUP BY year, {geo_group} {field1}, {field2}""".format(field1=field1, field2=field2, geo_group=geo_sql)
    order_sql = """ ORDER by {field1}, {field2} ASC """.format(field1=field1, field2=field2)
    return_sql = dist_sql + where_sql + group_sql + order_sql
    print(return_sql)
    return return_sql
#test 90000451965

In [16]:
def get_field_dist(year=None, field1=None, field2=None, geo_level='', prop_type=None, loan_purp=None, loan_type=None, occupancy=None, lien=None):
    """executes SQL to get distributions of data by selected geography for the stated field for multiple years of hmda"""
    first = True
    while year > 2003:
        table = 'hmdalar' + str(year)
        print(table)
        cur.execute(field_dist_geo(table=table, field1=field1, field2=field2, geo_level=geo_level, prop_type=prop_type,  loan_purp=loan_purp, occupancy=occupancy, lien=lien))        
        data_df = pd.DataFrame(cur.fetchall())

        col_names = [desc[0] for desc in cur.description]
        if len(data_df.columns) == len(col_names):
            print('setting column names')
            data_df.columns = col_names

        if first == True and len(data_df.columns) > 0:
            dist_df = data_df.copy()
            first = False

        elif first == False and len(data_df.columns) > 0:
            print('merging dataframes')
            dist_df=pd.concat([dist_df, data_df])

        else:
            print('no data returned from query')

        print(dist_df.tail())
        path = 'data/'
        if not os.path.exists(path):
            os.makedirs(path)

        year -= 1
    dist_df.to_csv(path + '{field1}_to_{field2}_dist_{geo_level}_all.csv'.format(field1=field1, field2=field2, geo_level=geo_level),index=False)

In [17]:
get_field_dist(year=2014, field1='income', field2='amount', loan_purp='1', prop_type='1',  occupancy='1', lien='1')

hmdalar2014
SELECT DISTINCT year,  income, amount
    FROM hmdalar2014 WHERE agency != '7' AND property_type IN ('1') AND loan_purpose IN ('1')
    AND  occupancy='1' AND lien = '1' AND income NOT ILIKE '%NA%' AND amount NOT ILIKE
    '%NA%' GROUP BY year,  income, amount ORDER by income, amount ASC
setting column names
        year income amount
220871  2014   9999  10000
220872  2014   9999  11727
220873  2014   9999  14000
220874  2014   9999  14470
220875  2014   9999  25513
hmdalar2013
SELECT DISTINCT year,  income, amount
    FROM hmdalar2013 WHERE agency != '7' AND property_type IN ('1') AND loan_purpose IN ('1')
    AND  occupancy='1' AND lien = '1' AND income NOT ILIKE '%NA%' AND amount NOT ILIKE
    '%NA%' GROUP BY year,  income, amount ORDER by income, amount ASC
setting column names
merging dataframes
        year income amount
215306  2013   9999  10000
215307  2013   9999  10500
215308  2013   9999  16250
215309  2013   9999  21000
215310  2013   9999  22100
hmdalar2012
SELECT DISTINCT year,  income, amount
    FROM hmdalar2012 WHERE agency != '7' AND property_type IN ('1') AND loan_purpose IN ('1')
    AND  occupancy='1' AND lien = '1' AND income NOT ILIKE '%NA%' AND amount NOT ILIKE
    '%NA%' GROUP BY year,  income, amount ORDER by income, amount ASC
setting column names
merging dataframes
        year income amount
190781  2012   9999  08278
190782  2012   9999  08450
190783  2012   9999  10000
190784  2012   9999  13600
190785  2012   9999  20340
hmdalar2011
SELECT DISTINCT year,  income, amount
    FROM hmdalar2011 WHERE agency != '7' AND property_type IN ('1') AND loan_purpose IN ('1')
    AND  occupancy='1' AND lien = '1' AND income NOT ILIKE '%NA%' AND amount NOT ILIKE
    '%NA%' GROUP BY year,  income, amount ORDER by income, amount ASC
setting column names
merging dataframes
        year income amount
176506  2011   9999  05640
176507  2011   9999  06750
176508  2011   9999  07050
176509  2011   9999  10000
176510  2011   9999  19800
hmdalar2010
SELECT DISTINCT year,  income, amount
    FROM hmdalar2010 WHERE agency != '7' AND property_type IN ('1') AND loan_purpose IN ('1')
    AND  occupancy='1' AND lien = '1' AND income NOT ILIKE '%NA%' AND amount NOT ILIKE
    '%NA%' GROUP BY year,  income, amount ORDER by income, amount ASC
setting column names
merging dataframes
        year income amount
177406  2010   9999  08000
177407  2010   9999  08525
177408  2010   9999  10000
177409  2010   9999  13000
177410  2010   9999  15000
hmdalar2009
SELECT DISTINCT year,  income, amount
    FROM hmdalar2009 WHERE agency != '7' AND property_type IN ('1') AND loan_purpose IN ('1')
    AND  occupancy='1' AND lien = '1' AND income NOT ILIKE '%NA%' AND amount NOT ILIKE
    '%NA%' GROUP BY year,  income, amount ORDER by income, amount ASC
setting column names
merging dataframes
        year income amount
175199  2009   9999  05000
175200  2009   9999  05200
175201  2009   9999  06000
175202  2009   9999  08524
175203  2009   9999  08580
hmdalar2008
SELECT DISTINCT year,  income, amount
    FROM hmdalar2008 WHERE agency != '7' AND property_type IN ('1') AND loan_purpose IN ('1')
    AND  occupancy='1' AND lien = '1' AND income NOT ILIKE '%NA%' AND amount NOT ILIKE
    '%NA%' GROUP BY year,  income, amount ORDER by income, amount ASC
setting column names
merging dataframes
        year income amount
207465  2008   9999  10987
207466  2008   9999  17000
207467  2008   9999  18600
207468  2008   9999  20000
207469  2008   9999  22500
hmdalar2007
SELECT DISTINCT year,  income, amount
    FROM hmdalar2007 WHERE agency != '7' AND property_type IN ('1') AND loan_purpose IN ('1')
    AND  occupancy='1' AND lien = '1' AND income NOT ILIKE '%NA%' AND amount NOT ILIKE
    '%NA%' GROUP BY year,  income, amount ORDER by income, amount ASC
setting column names
merging dataframes
        year income amount
246741  2007   9999  16800
246742  2007   9999  17500
246743  2007   9999  19200
246744  2007   9999  20000
246745  2007   9999  99999
hmdalar2006
SELECT DISTINCT year,  income, amount
    FROM hmdalar2006 WHERE agency != '7' AND property_type IN ('1') AND loan_purpose IN ('1')
    AND  occupancy='1' AND lien = '1' AND income NOT ILIKE '%NA%' AND amount NOT ILIKE
    '%NA%' GROUP BY year,  income, amount ORDER by income, amount ASC
setting column names
merging dataframes
        year income amount
241334  2006   9999  09425
241335  2006   9999  09600
241336  2006   9999  10450
241337  2006   9999  12500
241338  2006   9999  13400
hmdalar2005
SELECT DISTINCT year,  income, amount
    FROM hmdalar2005 WHERE agency != '7' AND property_type IN ('1') AND loan_purpose IN ('1')
    AND  occupancy='1' AND lien = '1' AND income NOT ILIKE '%NA%' AND amount NOT ILIKE
    '%NA%' GROUP BY year,  income, amount ORDER by income, amount ASC
setting column names
merging dataframes
        year income amount
238902  2005   9999  05700
238903  2005   9999  06000
238904  2005   9999  07000
238905  2005   9999  10000
238906  2005   9999  11813
hmdalar2004
SELECT DISTINCT year,  income, amount
    FROM hmdalar2004 WHERE agency != '7' AND property_type IN ('1') AND loan_purpose IN ('1')
    AND  occupancy='1' AND lien = '1' AND income NOT ILIKE '%NA%' AND amount NOT ILIKE
    '%NA%' GROUP BY year,  income, amount ORDER by income, amount ASC
setting column names
merging dataframes
        year income amount
215868  2004   9999  09999
215869  2004   9999  10000
215870  2004   9999  11000
215871  2004   9999  12000
215872  2004   9999  18000